class Solution {
    public int solution(int n, long l, long r) {
        long answer = r-l+1;
        for(long i=l-1;i<=r-1;i++){
            for(int j=0;j<n;j++){
                if((i/(int)Math.pow(5,j))%5==2){
                    answer--;
                    break;
                }
            }
        }

        return (int) answer;
    }
}

/*
0번째는 1 : 1
1번째는 11011 : 5
2번째는 11011 11011 0000 11011 11011 : 25 : 
3번째는 11011 11011 0000 11011 11011 | 11011 11011 0000 11011 11011 | 00000 00000 00000 00000 00000 | 11011 11011 0000 11011 11011 | 11011 11011 0000 11011 11011 : 125

0 1 2 3 4
1 1 0 1 1
1 1 0 1 1
0 0 0 0 0 
1 1 0 1 1
1 1 0 1 1

*/